# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке
# -- coding: utf-8--
one = int(input('введите 1 число'))
two = int(input('введите 2 число'))
three = int(input('введите 3 число'))
print('Сумма ваших чисел равна: ' + (one + two + three))