# Вывести на экран "Курс Основы программирования начался".
# -- coding: utf-8--
print("Курс Основы программирования начался")